podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/MCM_MK10D10.svd.xml
<!--
Devices using this peripheral: 
      MK10D10
      MK20D10
      MK30D10
      MK40D10
      MK50D10
      MK51D10
      MK52D10
      MK53D10
      MK60D10
-->
      <peripheral>
         <?sourceFile "MCM_MK10D10" ?>
         <name>MCM</name>
         <description>Core Platform Miscellaneous Control Module</description>
         <groupName>MCM</groupName>
         <headerStructName>MCM</headerStructName>
         <baseAddress>0xE0080000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "16" ?>
            <offset>0x8</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xC</offset>
            <size>0x14</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x30</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>PLASC</name>
               <description>Crossbar Switch (AXBS) Slave Configuration</description>
               <addressOffset>0x8</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x1F</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>ASC</name>
                     <description>Each bit in the ASC field indicates whether there is a corresponding connection to the crossbar switch&apos;s slave input port</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>A bus slave connection to AXBS input port n is absent</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>A bus slave connection to AXBS input port n is present</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PLAMC</name>
               <description>Crossbar Switch (AXBS) Master Configuration</description>
               <addressOffset>0xA</addressOffset>
               <size>16</size>
               <access>read-only</access>
               <resetValue>0x3F</resetValue>
               <resetMask>0xFFFF</resetMask>
               <fields>
                  <field>
                     <name>AMC</name>
                     <description>Each bit in the AMC field indicates whether there is a corresponding connection to the AXBS master input port</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>A bus master connection to AXBS input port n is absent</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>A bus master connection to AXBS input port n is present</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <description>Control Register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>SRAMUAP</name>
                     <description>SRAM_U arbitration priority</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Round robin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Special round robin (favors SRAM backoor accesses over the processor)</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Fixed priority. Processor has highest, backdoor has lowest</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Fixed priority. Backdoor has highest, processor has lowest</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRAMUWP</name>
                     <description>SRAM_U write protect</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field derivedFrom="SRAMUAP" > <name>SRAMLAP</name> <description>SRAM_L arbitration priority</description> <bitOffset>28</bitOffset> </field>
                  <field>
                     <name>SRAMLWP</name>
                     <description>SRAM_L Write Protect</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISR</name>
               <description>Interrupt Status Register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>Normal Interrupt Pending</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No pending interrupt</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Due to the ETB counter expiring, a normal interrupt is pending</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NMI</name>
                     <description>Non-maskable Interrupt Pending</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No pending NMI</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Due to the ETB counter expiring, an NMI is pending</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DHREQ</name>
                     <description>Debug Halt Request Indicator</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No debug halt request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Debug halt request initiated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ETBCC</name>
               <description>ETB Counter Control register</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>CNTEN</name>
                     <description>Counter Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>ETB counter disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>ETB counter enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSPT</name>
                     <description>Response Type</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>No response when the ETB count expires</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Generate a normal interrupt when the ETB count expires</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Generate an NMI when the ETB count expires</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Generate a debug halt when the ETB count expires</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RLRQ</name>
                     <description>Reload Request</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No effect</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clears pending debug halt, NMI, or IRQ interrupt requests</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ETDIS</name>
                     <description>ETM-To-TPIU Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>ETM-to-TPIU trace path enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>ETM-to-TPIU trace path disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ITDIS</name>
                     <description>ITM-To-TPIU Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>ITM-to-TPIU trace path enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>ITM-to-TPIU trace path disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ETBRL</name>
               <description>ETB Reload register</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>RELOAD</name>
                     <description>Byte Count Reload Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ETBCNT</name>
               <description>ETB Counter Value register</description>
               <addressOffset>0x1C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>COUNTER</name>
                     <description>Byte Count Counter Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PID</name>
               <description>Process ID register</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>PID</name>
                     <description>M0_PID And M1_PID For MPU</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
